export const General = {
  Q1: `ในคืนที่เวทมนตร์ในตัวของน้องๆได้ตื่นขึ้น และปากกาขนนกเวทมนตร์ที่ฮอกวอตส์ตรวจจับได้
และน้องๆจะต้องซื้อของวิเศษ 1 อย่าง จากร้านค้าในตรอกไดแอกอน เพื่อที่จะเตรียมตัวเข้าศึกษาในโรงเรียนเวทมนตร์แห่งนี้ โดยเลือกจากตัวเลือกนี้ พร้อมให้เหตุผล
1.ไม้กวาดคู่ใจที่มีชีวิตจิตใจและซื่อสัตย์ พร้อมที่จะพาเจ้าของผจญภัยไปได้ทุกที่และทุกมิติความเป็นจริง
2.ผ้าคลุมล่องหน ผ้าคลุมที่สามารถหลบซ่อนได้ทุกสัมผัสไม่ว่าจะเป็น รูป รส กลิ่น เสียง หรือแม้กระทั่งวิญญาณ
`,
  Q2: `ในขณะที่น้องๆกำลังเรียนรู้ศาสตร์เวทมนตร์อย่างจัดจ้าน น้องได้ทดลองเสกคาถาผู้พิทักษ์
แต่น้องๆเป็นคนที่มีพลังเวทมนตร์กล้าแกร่ง น้องๆจึงเลือกสัตว์ได้สามตัวมาเป็นผู้พิทักษ์
ผู้พิทักษ์ตัวแรก คือ สัตว์ที่น้องชอบที่สุด
ผู้พิทักษ์ตัวที่สอง คือ สัตว์ที่น้องอยากเอามาเป็นสัตว์เลี้ยง
ผู้พิทักษ์ตัวที่สาม คือ สัตว์ที่น้องชอบรองลงมา
จงเลือกสัตว์มาสามตัว พร้อมทั้งให้เหตุผลว่าทำไมจึงเลือกสามตัวนี้
`,
  Q3: `ถ้าน้องเป็นพ่อมดแม่มดที่มีพลังเวทย์มนต์วิเศษกว่าใคร น้องคิดว่าน้องจะนำพลังเวทย์มนต์ที่น้องมีนั้น ไปใช้พัฒนาประเทศของเราอย่างไร ?`
}

export const Design = {
  Q1: `1. สมมติว่าน้องได้รับมอบหมายจากผู้อำนวยการโรงเรียน ให้ทำเว็บไซต์สำหรับประชาสัมพันธ์โครงการภาควิชาการเวทมนตร์เป็นที่แรกในประเทศไทย​ แต่เนื่องจากเว็บนี้ไม่เคยมีก่อนเลย น้องคิดว่าอะไรเป็นสิ่งที่ควรจะมีบนหน้าเว็บ และจะมีหน้าตาแสดงผลอย่างไร เพราะอะไร?`,
  Q2: `2. ในปัจจุบันมีเว็บไซต์สำหรับซื้อสินค้าออนไลน์อยู่มากมาย เช่น Shopee, Lazada, AliExpress ในมุมมองน้อง คิดว่าการออกแบบของเว็บซื้อสินค้าออนไลน์ใดที่ทำให้น้องรู้สึกสนใจอยากซื้อสินค้ามากที่สุด เพราะอะไร`,
  Q3: `3. เพื่อเตรียมตัวสู่การเป็นนักเรียนในโลกเวทมนตร์ น้องได้รับอนุญาติให้นำสิ่งของวิเศษพกติดตัวไปได้หนึ่งอย่าง อยากให้น้องลองออกแบบหน้าตา ด้วยวิธีการใดก็ได้ ขึ้นมาพร้อมทั้งเขียนสรรพคุณให้พี่ๆ เข้าใจ โดยส่งเป็นไฟล์ภาพขึ้นมา 1 ภาพ`,
  Q4: `4. ภาพประกอบข้อ 3`
}

export const Programming = {
  Q1: `1. ในสายตาของน้องๆที่กำลังจะมาเป็นนักเวทฝึกหัด น้องๆคงจะเห็นเว็บไซต์มามากมายนับไม่ถ้วน จากเว็บเหล่านั้น ให้น้องเลือกมา 1 เว็บไซต์ที่น้องๆ ชื่นชอบมากที่สุด พร้อมบอกเหตุผลประกอบ`,
  Q2: `2. สำหรับน้องๆ ที่กำลังจะมาศึกษาการเป็น Web Programmer น้องๆ คิดว่าในอนาคต สิ่งที่จำเป็น สำหรับการเป็น Web Programmer คืออะไร? พร้อมคำอธิบาย`,
  Q3: `3.1 สำหรับน้องๆ ที่มีผลงานเก่าๆ สามารถส่งเว็บไซต์ที่น้องๆ เคยทำมาก่อน โดยส่งเป็น ZIP อัพลง Public Repositoy หรือ URL ของเว็บไซต์ ที่น้องๆ ทำมาได้

  3.2 ให้น้องๆ พัฒนาเว็บไซต์ขึ้นมาตามภาพด้านล่าง โดยจะใช้เทคนิคอะไร ภาษาอะไร เติมแต่งอะไรได้เต็มที่! โดยส่ง Source code ได้ทั้งวิธีคัดลอกโค้ดมาวาง อัพไฟล์ Zip หรืออัพลง Public Repository เช่น GitHub แล้วแปะลิ้งก์ไว้`
}

export const Content = {
  Q1: `1. ถ้าน้องๆ สามารถขอพรพิเศษได้ 1 อย่าง พรที่น้องจะขอนั้นคือพรอะไร และน้องจะนำพรนั้นไปใช้งานอย่างไรบ้าง ลองเล่ามาให้พี่ๆ ฟังหน่อย`,
  Q2: `2. สมมติว่าน้องๆ ได้เป็นผู้นำแห่งเมืองเวทมนตร์ JWC แล้วต้องคิด 1 นโยบายเพื่อพัฒนาชาวเมือง นโยบายของน้องจะเป็นอย่างไร บอกรายละเอียดโดยสังเขป และเล่าว่าจะสื่อสารอย่างไรให้ชาวเมืองเห็นด้วย`,
  Q3: `3. มีข้อมูลมากมายออกมาเกี่ยวกับปัญหาเรื่อง PM2.5 ที่น้องๆ ก็คงเผชิญมา พี่เลยอยากให้น้องๆ ลองสรุปเรื่องเกี่ยวกับ PM2.5 ในรูปแบบใดก็ได้ให้พี่ๆ เข้าใจ (ไม่เกิน 1,000 ตัวอักษร)`
}

export const Marketing = {
  Q1: `1. ในรอบ 5 ปีที่ผ่านมา น้องๆ คิดว่า “การเรียนพิเศษ” มีการเปลี่ยนแปลงไปอย่างไรบ้าง แล้วอนาคตจะมีแนวโน้มพัฒนาขึ้นอย่างไร ในด้านของตัวสินค้า ราคา โปรโมชั่น และแหล่งที่จำหน่ายสินค้า โดยให้เหตุผลและยกตัวอย่างประกอบ`,
  Q2: `2. สมมติว่าวันหนึ่ง Elon Musk สามารถนำคนไปอยู่ในโลกเวทมนตร์ได้ ให้น้องคิดสินค้าหรือบริการขึ้นมา 1 อย่าง ที่ตอบกลุ่มเป้าหมายในโลกเวทมนตร์ พร้อมอธิบายเหตุผลที่ทุกคนต้องซื้อสินค้าจากน้อง`,
  Q3: `3. จากข้อ 2 น้องๆ จะโปรโมตสินค้าหรือบริการที่น้องคิด ผ่านช่องทาง Social Media ใดบ้าง พร้อมเล่าเหตุผล (โลกเวทมนตร์สามารถใช้ Social Media ได้เหมือนโลกของพวกเรานะ)`
}

export default {
  general: General,
  design: Design,
  programming: Programming,
  content: Content,
  marketing: Marketing
}
