export const General = {
  Q1: `1. ในคืนที่เวทมนตร์ในตัวของน้องๆได้ตื่นขึ้น และปากกาขนนกเวทมนตร์ที่ฮอกวอตส์ตรวจจับได้
และน้องๆจะต้องซื้อของวิเศษ 1 อย่าง จากร้านค้าในตรอกไดแอกอน เพื่อที่จะเตรียมตัวเข้าศึกษาในโรงเรียนเวทมนตร์แห่งนี้ โดยเลือกจากตัวเลือกนี้ พร้อมให้เหตุผล
  1.ไม้กวาดคู่ใจที่มีชีวิตจิตใจและซื่อสัตย์ พร้อมที่จะพาเจ้าของผจญภัยไปได้ทุกที่และทุกมิติความเป็นจริง
  2.ผ้าคลุมล่องหน ผ้าคลุมที่สามารถหลบซ่อนได้ทุกสัมผัสไม่ว่าจะเป็น รูป รส กลิ่น เสียง หรือแม้กระทั่งวิญญาณ
`,
  Q2: `2. ในขณะที่น้องๆกำลังเรียนรู้ศาสตร์เวทมนตร์อย่างจัดจ้าน น้องได้ทดลองเสกคาถาผู้พิทักษ์
แต่น้องๆเป็นคนที่มีพลังเวทมนตร์กล้าแกร่ง น้องๆจึงเลือกสัตว์ได้สามตัวมาเป็นผู้พิทักษ์
ผู้พิทักษ์ตัวแรก คือ สัตว์ที่น้องชอบที่สุด
ผู้พิทักษ์ตัวที่สอง คือ สัตว์ที่น้องอยากเอามาเป็นสัตว์เลี้ยง
ผู้พิทักษ์ตัวที่สาม คือ สัตว์ที่น้องชอบรองลงมา
จงเลือกสัตว์มาสามตัว พร้อมทั้งให้เหตุผลว่าทำไมจึงเลือกสามตัวนี้
`,
  Q3: `3. ถ้าน้องเป็นพ่อมดแม่มดที่มีพลังเวทย์มนต์วิเศษกว่าใคร น้องคิดว่าน้องจะนำพลังเวทย์มนต์ที่น้องมีนั้น ไปใช้พัฒนาประเทศของเราอย่างไร ?`
}

export const App = {
  Q1: `1. น้องๆอยากทำ App อะไรที่ไว้ใช้เองบ้าง อธิบายขั้นตอนการทำงาน`,
  Q2: `2. จงบอก App ที่น้องๆ ชอบมากที่สุดมา  3  อย่างเพราะอะไร`,
  Q3: `3. จงอธิบายขั้นตอนการเข้าเว็บคณะไอที มาอย่างละเอียดเป็นข้อๆ`,
  Q4: `4. แนะนำตัวเอง เหมือนกับว่าทำไมพี่ถึงต้องรับน้องเข้ามา`,
  Q5: `5. น้อง ๆ เคยมีประสบการณ์การเขียนโปรแกรมภาษาต่างๆไหม การแข่งขันต่างๆทางด้าน IT ไหม หรือมาแต่ใจล้วน ๆ`
}

export default {
  general: General,
  app: App
}
