export const General = {
  Q1: `1. ในคืนที่เวทมนตร์ในตัวของน้องๆได้ตื่นขึ้น และปากกาขนนกเวทมนตร์ที่ฮอกวอตส์ตรวจจับได้
และน้องๆจะต้องซื้อของวิเศษ 1 อย่าง จากร้านค้าในตรอกไดแอกอน เพื่อที่จะเตรียมตัวเข้าศึกษาในโรงเรียนเวทมนตร์แห่งนี้ โดยเลือกจากตัวเลือกนี้ พร้อมให้เหตุผล
  1.ไม้กวาดคู่ใจที่มีชีวิตจิตใจและซื่อสัตย์ พร้อมที่จะพาเจ้าของผจญภัยไปได้ทุกที่และทุกมิติความเป็นจริง
  2.ผ้าคลุมล่องหน ผ้าคลุมที่สามารถหลบซ่อนได้ทุกสัมผัสไม่ว่าจะเป็น รูป รส กลิ่น เสียง หรือแม้กระทั่งวิญญาณ
`,
  Q2: `2. ในขณะที่น้องๆกำลังเรียนรู้ศาสตร์เวทมนตร์อย่างจัดจ้าน น้องได้ทดลองเสกคาถาผู้พิทักษ์
แต่น้องๆเป็นคนที่มีพลังเวทมนตร์กล้าแกร่ง น้องๆจึงเลือกสัตว์ได้สามตัวมาเป็นผู้พิทักษ์
  ผู้พิทักษ์ตัวแรก คือ สัตว์ที่น้องชอบที่สุด
  ผู้พิทักษ์ตัวที่สอง คือ สัตว์ที่น้องอยากเอามาเป็นสัตว์เลี้ยง
  ผู้พิทักษ์ตัวที่สาม คือ สัตว์ที่น้องชอบรองลงมา
จงเลือกสัตว์มาสามตัว พร้อมทั้งให้เหตุผลว่าทำไมจึงเลือกสามตัวนี้
`,
  Q3: `3. ถ้าน้องเป็นพ่อมดแม่มดที่มีพลังเวทย์มนต์วิเศษกว่าใคร น้องคิดว่าน้องจะนำพลังเวทย์มนต์ที่น้องมีนั้น ไปใช้พัฒนาประเทศของเราอย่างไร ?`
}

export const App = {
  Q1: `1. น้องๆอยากทำ App อะไรที่ไว้ใช้เองบ้าง อธิบายขั้นตอนการทำงาน`,
  Q2: `2. จงบอก App ที่น้องๆ ชอบมากที่สุดมา  3  อย่างเพราะอะไร`,
  Q3: `3. จงอธิบายขั้นตอนการเข้าเว็บคณะไอที มาอย่างละเอียดเป็นข้อๆ`,
  Q4: `4. แนะนำตัวเอง เหมือนกับว่าทำไมพี่ถึงต้องรับน้องเข้ามา`,
  Q5: `5. น้อง ๆ เคยมีประสบการณ์การเขียนโปรแกรมภาษาต่างๆไหม การแข่งขันต่างๆทางด้าน IT ไหม หรือมาแต่ใจล้วน ๆ`
}

export const Network = {
  Q1: `1. พี่อยากให้น้องพูดถึงอินเตอร์เน็ต และ/หรือ เครือข่ายที่น้องกำลังเชื่อมต่ออยู่ตอนนี้ให้พี่หน่อย?`,
  Q2: `2. Packet Tracer, GNS3, EVE-NG, Wireshark, Nmap, PuTTy น้องรู้จัก, เคยได้ยินหรือเคยเห็น, เคยใช้โปรแกรมใดโปรแกรมหนึ่งไหม ?`,
  Q3: `3. น้องๆ คิดว่า Network ที่เราใช้อยู่ทุกวันนี้ ใกล้เคียงกับอะไรในโลกของพ่อมดแม่มด`,
  Q4: `4. คิดว่าค่ายนี้เกี่ยวกับอะไร และสอนอะไร ( สิ่งที่คาดหวังว่าจะได้รับจากค่ายนี้ )?`,
  Q5: `5. น้องๆ ชอบตัวละครใดมากที่สุดในเรื่อง Harry Potter เพราะอะไร และเป็นแรงบันดาลใจอะไรให้น้อง?`
}

export const Data = {
  Q1: `1. ถ้าน้องๆเป็นคุณครูสอนวิชา คณิตศาสตร์ แล้วเห็นคะแนนสอบกลางภาคเป็นดังรูปที่1 จงอธิบายสิ่งที่เกิดขึ้นในมุมมองของ คะแนน,ที่นั่ง,การเข้าเรียน หรือในมุมมองต่าง ตามความคิดของน้องๆ
** รูป 1 คะแนนในห้อง
** รูป 2 ที่นั่งในห้อง
** รูป 3 ใบแจ้งว่าคนไหนขาดเรียนหรือเข้าสายกี่ครั้งจากจำนวนการสอนทั้งหมด 8ครั้ง
`,
  Q2: `2. เลือกคำจากรูปภาพ ที่สื่อถึงความเป็น DATA SCIENCE มาทั้งหมด 5คำ แล้วอธิบายเหตุผลที่เลือกมา`,
  Q3: `3. ให้น้องๆเลือกคนที่อยากจะทำงานด้วยมากที่สุด และไม่อยากทำงานด้วยมากที่สุด มาอย่างละ 3คน แล้วคิดว่าจะเกิดปัญหาอะไรบ้างระหว่างการทำงาน จากคนทั้ง5คนที่กำหนดให้ดังนี้
    - A บาสคือชีวิตงานค่อยคิด แต่ทำงานไว
    - B ทำได้หมดขอเวลาทำหน่อย
    - C BNK ไม่รู้จักอะแถมไปทุกงาน แต่งานก็เสร็จหมดนะ
    - D เก่งหมดจยนะ (เก่งเกินไปด้วย)
    - E เดินงงไปวันๆ
`,
  Q4: `4. สิ่งที่คาดหวังหลังจบค่าย`,
  Q5: `5. น้องๆคิดว่าเราจะแก้ปัญหา PM 2.5 กันยังไงดี`
}

export const Game = {
  Q1: `1. บอกแนวเกมที่น้องๆชอบมากที่สุด เพราะอะไรพร้อมอธิบายเหตุผล`,
  Q2: `2. ให้น้องๆอธิบายเกี่ยวกับเกมที่น้องๆอยากสร้าง`,
  Q3: `3. (ต่อเนื่องจากข้อที่แล้ว) หากตัวละครตัวนนี้อยู่ในเกมที่น้องสร้างจะให้ตัวละครนี้รับบทบาดอะไร จะตั้งชื่อว่าอะไร และอยากให้ตัวละครนี้มีความสามารถอะไร`,
  Q4: `4. หากน้องๆมีโอกาสได้เป็นส่วนหนึ่งในทีมสร้างเกมน้องอยากทำหน้าที่อะไรในทีมพร้อมอธิบายเหตุผล`,
  Q5: `5. น้องๆคาดหวังอะไรบ้างกับค่ายสร้างเกม GrindelGame`
}

export const IoT = {
  Q1: `1. ในความคิดของน้อง IoT คืออะไร และจะนำ IoT ไปประยุกต์ใช้อย่างไร`,
  Q2: `2. ทำไมน้องถึงเลือกสมัครค่าย IoT และน้องคาดหวังอะไรจากการมาเข้าค่าย`,
  Q3: `3. ถ้าน้องสามารถสร้างสิ่งประดิษฐ์อะไรก็ได้ขึ้นมาหนึ่งชิ้น น้องจะสร้างอะไร สิ่งนั้นสามารถทำอะไรได้ (สร้างอะไรก็ได้ตามจินตนาการของน้องเลย)`,
  Q4: `4. กีฬาควิดดิช เป็นเกมกีฬาที่ได้รับความนิยมมากในโลกเวทมนต์ พี่ ๆ อยากจัดการแข่งขันควิดดิชรอบพิเศษขึ้น ภายในค่าย IT Camp โดยมีผู้เล่นเข้าร่วมแข่งขันในแต่ละรอบ 2 ถึง 14 คน แบ่งออกเป็น 2 ฝ่าย และจำนวนผู้เล่นทั้งสองฝ่ายมีค่าต่างกันไม่เกิน 1 (เช่น มีผู้เล่น 7 คน จะแบ่งเป็นฝ่ายแรก 3 คน ฝ่ายที่สอง 4 คน หรือ จะแบ่งฝ่ายแรก 4 คน ฝ่ายที่สอง 3 คน)

ให้น้องสร้างฟังก์ชันเพื่อแสดงจํานวนวิธีในการแบ่งฝ่ายทั้งหมดที่เป็นไปได้ จากค่าของจำนวนผู้เล่นที่ใส่เข้าไป เช่น
function(2) จะได้ผลลัพธ์เป็น 2
function(3) จะได้ผลลัพธ์เป็น 6
function(4) จะได้ผลลัพธ์เป็น 6

โดยน้องสามารถเขียนเป็นวิธีคิด หรือเขียนเป็น pseudo code หรือเขียนโปรแกรมเป็นภาษาใดก็ได้ (บอกพี่ ๆ ด้วยนะว่าเขียนภาษาอะไร)
`,
  Q5: `5. น้องมีพื้นฐานการเขียนโปรแกรม หรือใช้งาน Arduino หรือบอร์ด microcontroller มาก่อนหรือไม่ ขอรายละเอียดให้พี่ ๆ หน่อยนะ`
}

export default {
  general: General,
  app: App,
  network: Network,
  data: Data,
  game: Game,
  iot: IoT
}
